app/Controllers/Dashboard.php

    public function index()
    {
        $userModel = new UsersModel();
        $bukuModel = new BukuModel();
        $pinjamModel = new PeminjamanModel();
        $kembaliModel = new PengembalianModel();

        $data = [
            'total_users' => $userModel->countAll(),
            'total_buku' => $bukuModel->countAll(),
            'total_peminjaman' => $pinjamModel->countAll(),
            'total_pengembalian' => $kembaliModel->countAll(),

            // sementara jika belum ada logic khusus
            'denda_belum' => 0,
            'total_kategori' => 0,
            'total_rak' => 0,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `rak`
SELECT COUNT(*) AS `numrows`
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `pengembalian`
SELECT COUNT(*) AS `numrows`
FROM `users`

    public function realtime()
    {
        return $this->response->setJSON([
            'total_users' => $this->db->table('users')->countAllResults(),
            'total_buku' => $this->db->table('buku')->countAllResults(),
            'total_peminjaman' => $this->db->table('peminjaman')->countAllResults(),
            'total_pengembalian' => $this->db->table('pengembalian')->countAllResults(),
            'denda_belum' => $this->db->table('denda')
                ->where('status_bayar', 'belum')
                ->countAllResults(),
            'total_kategori' => $this->db->table('kategori')->countAllResults(),
            'total_rak' => $this->db->table('rak')->countAllResults(),
        ]);
---
SELECT COUNT(*) AS `numrows`
FROM `denda`
WHERE `status_bayar` = 'belum'