app/Controllers/Denda.php

    public function index()
    {
        $builder = $this->db->table('denda d');
        $builder->select('d.*, u.nama');
        $builder->join('peminjaman p', 'p.id_peminjaman = d.id_peminjaman');
        $builder->join('users u', 'u.id_user = p.id_anggota');

        $data['denda'] = $builder->get()->getResultArray();
---
SELECT `d`.*, `u`.`nama`
FROM `denda` `d`
JOIN `peminjaman` `p` ON `p`.`id_peminjaman` = `d`.`id_peminjaman`
JOIN `users` `u` ON `u`.`id_user` = `p`.`id_anggota`