app/Controllers/Home.php

    public function index(): string
    {
        $role   = session()->get('role');
        $idUser = session()->get('id_user') ?? session()->get('id');

        $data['total_users']        = $this->db->table('users')->countAllResults();
        $data['total_buku']         = $this->db->table('buku')->countAllResults();
        $data['total_peminjaman']   = $this->db->table('peminjaman')->countAllResults();
        $data['total_pengembalian'] = $this->db->table('pengembalian')->countAllResults();
        $data['total_kategori']     = $this->db->table('kategori')->countAllResults();
        $data['total_rak']          = $this->db->table('rak')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
SELECT COUNT(*) AS `numrows`
FROM `pengembalian`
SELECT COUNT(*) AS `numrows`
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `rak`