app/Controllers/Kategori.php

    public function index()
    {
        return view('kategori/index',[
            'data'=>$this->model->findAll()
        ]);
---
SELECT *
FROM `kategori`