app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `users`.`nama`, `buku`.`judul`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
JOIN `detail_peminjaman` ON `detail_peminjaman`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
---
    public function index()
{
    $builder = $this->db->table('peminjaman');
    $builder->select('peminjaman.*, users.nama, buku.judul');

    // ✅ FIX DI SINI
    $builder->join('users', 'users.id_user = peminjaman.id_anggota', 'left');

    $builder->join('detail_peminjaman', 'detail_peminjaman.id_peminjaman = peminjaman.id_peminjaman', 'left');
    $builder->join('buku', 'buku.id_buku = detail_peminjaman.id_buku', 'left');
    $data['peminjaman'] = $builder->get()->getResultArray();

SELECT *
FROM `buku`
SELECT *
FROM `users`
---
    public function create()
{
    $data['buku'] = $this->db->table('buku')->get()->getResultArray();

    // 🔥 TAMBAHKAN INI
    $data['users'] = $this->db->table('users')->get()->getResultArray();

SELECT *
FROM `buku`
WHERE `id_buku` = '1'
---

foreach ($id_buku as $buku) {

    $dataBuku = $this->db->table('buku')
        ->where('id_buku', $buku)
        ->get()->getRowArray();

INSERT INTO `detail_peminjaman` (`id_peminjaman`, `id_buku`, `jumlah`, `dikembalikan`) VALUES (20, '1', 1, 0)
---
        dd('BUKU TIDAK DITEMUKAN');
    }

    $this->db->table('detail_peminjaman')->insert([
        'id_peminjaman' => $id_peminjaman,
        'id_buku' => $buku,
        'jumlah' => 1,
        'dikembalikan' => 0
    ]);

UPDATE `buku` SET `jumlah` = 8
WHERE `id_buku` = '1'
---
    }
}

        $this->db->table('buku')
            ->where('id_buku', $buku)
            ->update([
                'jumlah' => $dataBuku['jumlah'] - 1
            ]);

SELECT `p`.*, `u`.`nama` as `nama_anggota`, `pt`.`jabatan` as `nama_petugas`
FROM `peminjaman` `p`
LEFT JOIN `users` `u` ON `u`.`id_user` = `p`.`id_anggota`
LEFT JOIN `petugas` `pt` ON `pt`.`id_petugas` = `p`.`id_petugas`
WHERE `p`.`id_peminjaman` = '35'
---
 public function detail($id)
{
    $data['peminjaman'] = $this->db->table('peminjaman p')
        ->select('
            p.*,
            u1.nama as nama_anggota,
            u2.nama as nama_petugas,
            b.judul
        ')
        ->join('users u1', 'u1.id_user = p.id_anggota', 'left')
        ->join('users u2', 'u2.id_user = p.id_petugas', 'left')
        ->join('detail_peminjaman dp', 'dp.id_peminjaman = p.id_peminjaman', 'left')
        ->join('buku b', 'b.id_buku = dp.id_buku', 'left')
        ->where('p.id_peminjaman', $id)
        ->get()
        ->getRowArray();