app/Controllers/Peminjaman.php

INSERT INTO `peminjaman` (`id_petugas`, `tanggal_pinjam`, `tanggal_kembali`, `status`) VALUES (1, '2026-04-21', '2026-04-27', 'dipinjam')
---
        ]);


        // ================= AMBIL ID ======================
        $id_peminjaman = $this->db->insertID();

UPDATE `peminjaman` SET `status` = 'dipinjam'
WHERE `id_peminjaman` = '94'
---
   public function setujui($id)
{
    $this->db->table('peminjaman')
        ->where('id_peminjaman', $id)
        ->update([
            'status' => 'dipinjam'
        ]);