app/Controllers/Penerbit.php

SELECT *
FROM `penerbit`
---
   public function index()
{
    $keyword = $this->request->getGet('keyword');

    if ($keyword) {
        $data['penerbit'] = $this->model
            ->like('nama_penerbit', $keyword)
            ->orLike('alamat', $keyword)
            ->findAll();
    } else {
        $data['penerbit'] = $this->model->findAll();