app/Controllers/Pengembalian.php

SELECT `p`.*, `pm`.`status` as `status_peminjaman`, `pm`.`tanggal_pinjam`, `pm`.`tanggal_kembali`, COALESCE(u.nama, "-") as nama_anggota, GROUP_CONCAT(b.judul SEPARATOR ", ") as judul
FROM `pengembalian` `p`
JOIN `peminjaman` `pm` ON `pm`.`id_peminjaman` = `p`.`id_peminjaman`
LEFT JOIN `users` `u` ON `u`.`id_user` = `pm`.`id_anggota`
LEFT JOIN `detail_peminjaman` `dp` ON `dp`.`id_peminjaman` = `pm`.`id_peminjaman`
LEFT JOIN `buku` `b` ON `b`.`id_buku` = `dp`.`id_buku`
GROUP BY `p`.`id_pengembalian`
ORDER BY `p`.`id_pengembalian` DESC
---
    public function index()
{
    $keyword = $this->request->getGet('keyword');

    $builder = $this->db->table('pengembalian p');

    $builder->select('
        p.*,
        pm.status as status_peminjaman,
        pm.tanggal_pinjam,
        pm.tanggal_kembali,
        COALESCE(u.nama, "-") as nama_anggota,
        GROUP_CONCAT(b.judul SEPARATOR ", ") as judul
    ');

    $builder->join('peminjaman pm', 'pm.id_peminjaman = p.id_peminjaman');
    $builder->join('users u', 'u.id_user = pm.id_anggota', 'left');
    $builder->join('detail_peminjaman dp', 'dp.id_peminjaman = pm.id_peminjaman', 'left');
    $builder->join('buku b', 'b.id_buku = dp.id_buku', 'left');

    // 🔍 SEARCH TAMBAHAN
    if ($keyword) {
        $builder->groupStart()
            ->like('pm.id_peminjaman', $keyword)
            ->orLike('u.nama', $keyword)
            ->orLike('p.status', $keyword)
            ->orLike('b.judul', $keyword)
        ->groupEnd();
    }

    $data['pengembalian'] = $builder
        ->groupBy('p.id_pengembalian')
        ->orderBy('p.id_pengembalian', 'DESC')
        ->get()
        ->getResultArray();