app/Controllers/Pengembalian.php

    // 🔥 ambil petugas dari pengembalian atau peminjaman
    $builder->join('users u2', 'u2.id_user = pm.id_petugas', 'left');

    $data['pengembalian'] = $builder->get()->getResultArray();
---
SELECT `p`.*, `u1`.`nama` as `id_peminjaman`, `u2`.`nama` as `nama_petugas`
FROM `pengembalian` `p`
JOIN `peminjaman` `pm` ON `pm`.`id_peminjaman` = `p`.`id_peminjaman`
LEFT JOIN `users` `u1` ON `u1`.`id_user` = `pm`.`id_anggota`
LEFT JOIN `users` `u2` ON `u2`.`id_user` = `pm`.`id_petugas`