app/Controllers/Penulis.php

    public function index()
{
    $keyword = $this->request->getGet('keyword');

    if ($keyword) {
        $data['penulis'] = $this->model
            ->like('nama_penulis', $keyword)
            ->findAll();
    } else {
        $data['penulis'] = $this->model->findAll();
---
SELECT *
FROM `penulis`