app/Controllers/Users.php

    public function index()
    {
        // Ambil parameter GET (search & filter)
        $keyword = $this->request->getGet('keyword');
        $role = $this->request->getGet('role');

        // Builder awal dari model
        $builder = $this->users;

        // Jika ada keyword → filter berdasarkan nama
        if ($keyword) {
            $builder = $builder->like('nama', $keyword);
        }

        // Jika ada filter role
        if ($role) {
            $builder = $builder->where('role', $role);
        }

        // Ambil data dengan pagination (10 data per halaman)
        $data['users'] = $builder->paginate(10);
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`